jmeter/summary.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
1.  NguoiDungTimKiemHang,1,23,23,23,0,0.00%,43.47826,465.27,14.52,10958
2. GioHang,1,27,27,27,0,0.00%,37.03704,5.21,101.16,144
3. DonHang,1,73,73,73,0,0.00%,13.69863,4.41,11.21,330
5.1. DangKy KhachHang,2,6,4,9,2.5,100.00%,142.85714,61.8,67.1,443
5.2. DangNhap Admin,1,377,377,377,0,0.00%,2.65252,0.96,0.48,369
5.3. DangNhap KhachHang,1,346,346,346,0,0.00%,2.89017,1.26,0.58,448
TOTAL,8,113,4,377,145.03,37.50%,10.98901,18.05,7.8,1682